// Даны числа A , B и C. От вас требуется написать программу, которая выведет на экран значение выражения A+B−C и само выражение.
//_______________________________________________________________________________________________________________________________

#include <iostream>
#include <sstream>
#include <iomanip>

using namespace std;

int main()
{
    int A, B, C, result;
    cin >> A >> B >> C;

    result = A + B - C;

    cout << A << " + " << B << " - " << C << " = " << result;

    return 0;
}